Revit 2027 API
DockablePane.PaneIsBuiltIn Method
 Returns true if %id% refers to a built-in Revit dockable pane, rather than one created by an add-in.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool PaneIsBuiltIn(
	DockablePaneId id
)
Public Shared Function PaneIsBuiltIn (
	id As DockablePaneId
) As Boolean
public:
static bool PaneIsBuiltIn(
	DockablePaneId^ id
)
static member PaneIsBuiltIn :
        id : DockablePaneId -> bool
Parameters
id DockablePaneId
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace